app/controllers/ads_controller.rb

SELECT * FROM "feedbacks" WHERE ("feedbacks"."adid" = '1')
---
  def show
    @feedbacks = Feedback.find_all_by_adid(params[:id])