app/controllers/feedbacks_controller.rb

INSERT INTO "feedbacks" ("name", "comment", "created_at", "adid", "updated_at", "email") VALUES('Ahmad', 'How much is the fix price???', '2009-10-15 06:54:04', 1, '2009-10-15 06:54:04', 'owolabbi@gmail.com')
---
  def create
    @feedback = Feedback.new(params[:feedback])

    respond_to do |format|
      if @feedback.save